app/views/timestamps/_form.html.erb

SELECT "members".* FROM "members"
---
					<%= f.label :members_id %><br>
					<%= f.select :members_id, Member.all.collect{|u| [u.name, u.id]}  %>

SELECT "projects".* FROM "projects"
---
					<%= f.label :projects_id %><br>
					<%= f.select :projects_id, Project.all.collect{|u| [u.name, u.id]}  %>