app/views/timestamps/index.html.erb

      <tr>
        <td><%=Member.find(timestamp.members_id).name %></td>
        <td><%=Project.find(timestamp.projects_id).name %></td>
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]