app/views/timestamps/show.html.erb

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 2]]
---
  <strong>Members:</strong>
  <%=Member.find(@timestamp.members_id).name %><>

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>Projects:</strong>
  <%=Project.find(@timestamp.projects_id).name %>