app/views/projects/new.html.erb

SELECT "members".* FROM "members"
---
    <%= f.label :Leader %>
    <%= f.select :member_id, Member.all.collect{|u| [u.name, u.id]}  %>