app/controllers/members_controller.rb

def create
  @member = Member.new(member_params)
  @member.save
---
INSERT INTO "members" ("created_at", "isleader", "name", "role_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 19 Nov 2014 03:19:52 UTC +00:00], ["isleader", true], ["name", "asd"], ["role_id", 1], ["updated_at", Wed, 19 Nov 2014 03:19:52 UTC +00:00]]

def show
  @member = Member.find(params[:id])
  ##<Member id: nil, name: "d", isleader: true, role_id: 1, created_at: nil, updated_at: nil>
  #render :text => CGI.escapeHTML(@member.role_id.inspect)
  @role = Role.find(@member.role_id)
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "roles".* FROM "roles" WHERE "roles"."member_id" = ? LIMIT 1  [[nil, 1]]

def index
  @members = Member.all #TODO tem q troca a porcaria da foreign key pelo nome do bagulho, maneira facil existe?
---
SELECT "members".* FROM "members"

def update
  @member = Member.find(params[:id])

  if @member.update(member_params)
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "members" SET "isleader" = ?, "role_id" = ?, "updated_at" = ? WHERE "members"."id" = 4  [["isleader", false], ["role_id", 1], ["updated_at", Wed, 19 Nov 2014 16:17:52 UTC +00:00]]