app/controllers/member_projects_controller.rb

SELECT "member_projects".* FROM "member_projects"
---
  def index
    @member_projects = MemberProject.all

INSERT INTO "member_projects" ("created_at", "members_id", "projects_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 20 Nov 2014 17:28:12 UTC +00:00], ["members_id", 1], ["projects_id", 1], ["updated_at", Thu, 20 Nov 2014 17:28:12 UTC +00:00]]
---
  def create
    @member_project = MemberProject.new(member_project_params)

    respond_to do |format|
      if @member_project.save

SELECT "member_projects".* FROM "member_projects" WHERE "member_projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_member_project
      @member_project = MemberProject.find(params[:id])