app/controllers/projects_controller.rb

def create
  @project = current_user.projects.new(project_params)

  @project.save
---
INSERT INTO "projects" ("created_at", "desc", "estTime", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 20 Nov 2014 23:24:43 UTC +00:00], ["desc", "lon@lon.com"], ["estTime", 10], ["name", "lon@lon.com"], ["updated_at", Thu, 20 Nov 2014 23:24:43 UTC +00:00], ["user_id", 1]]

def show
  @project = current_user.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT 1  [["user_id", 3], ["id", "2"]]

def index
  @projects = current_user.projects.all
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 2]]

def edit
  @project = current_user.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT 1  [["user_id", 3], ["id", "2"]]

def update
  @project = current_user.projects.find(params[:id])

  if @project.update(project_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = 5  [["name", "ertert"], ["updated_at", Wed, 19 Nov 2014 19:20:26 UTC +00:00]]

def destroy
  @project = current_user.projects.find(params[:id])
  @project.destroy
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]