app/controllers/roles_controller.rb

def create
  @role = Role.new(role_params)

  @role.save
---
INSERT INTO "roles" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 18 Nov 2014 19:00:30 UTC +00:00], ["name", "WebDesigner"], ["updated_at", Tue, 18 Nov 2014 19:00:30 UTC +00:00]]

def show
  @role = Role.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "1"]]

def edit
  @role = Role.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "1"]]

def update
  @role = Role.find(params[:id])

  if @role.update(role_params)
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "roles" SET "name" = ?, "updated_at" = ? WHERE "roles"."id" = 3  [["name", "Software Engineerrrr"], ["updated_at", Tue, 18 Nov 2014 20:11:59 UTC +00:00]]

def destroy
  @role = Role.find(params[:id])
  @role.destroy
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "roles" WHERE "roles"."id" = ?  [["id", 1]]