app/controllers/site_controller.rb

  def index
    # retrieve all projects ordered by descending creation timestamp
    @projects = Project.order('created_at desc')
---
SELECT "projects".* FROM "projects" ORDER BY created_at desc