app/controllers/timestamps_controller.rb

  def index
    @timestamps = Timestamp.all
---
SELECT "timestamps".* FROM "timestamps"

  def create
    @timestamp = Timestamp.new(timestamp_params)

    respond_to do |format|
      if @timestamp.save
---
INSERT INTO "timestamps" ("created_at", "date", "members_id", "projects_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 20 Nov 2014 22:03:15 UTC +00:00], ["date", Thu, 20 Nov 2014 22:02:00 UTC +00:00], ["members_id", 1], ["projects_id", 1], ["updated_at", Thu, 20 Nov 2014 22:03:15 UTC +00:00]]

  def destroy
    @timestamp.destroy
---
DELETE FROM "timestamps" WHERE "timestamps"."id" = ?  [["id", 2]]

    def set_timestamp
      @timestamp = Timestamp.find(params[:id])
---
SELECT "timestamps".* FROM "timestamps" WHERE "timestamps"."id" = ? LIMIT 1  [["id", "2"]]