app/views/member_projects/index.html.erb

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
      <tr>
        <td><%=Member.find(member_project.members_id).name %></td>
        <td><%=Project.find(member_project.projects_id).name %></td>