app/views/member_projects/show.html.erb

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>Members:</strong>
  <%=Member.find(@member_project.members_id).name %>

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
  <strong>Projects:</strong>
  <%=Project.find(@member_project.projects_id).name %>