app/views/members/edit.html.erb

    <%= f.check_box :isleader %><br>
    <%= f.select :role_id, Role.all.collect{|u| [u.name, u.id]}  %>
---
SELECT "roles".* FROM "roles"