app/views/members/index.html.erb

SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", 2]]
---
    <td><%= member.isleader %></td>
    <td><%= Role.find(member.role_id).name %></td>