app/views/members/new.html.erb

SELECT "roles".* FROM "roles"
---
    <%= f.check_box :isleader %><br>
    <%= f.select :role_id, Role.all.collect{|u| [u.name, u.id]}  %>