app/views/members/show.html.erb

  <strong>member:</strong>
  <%=Role.find(@member.role_id).name %>
---
SELECT "roles".* FROM "roles" WHERE "roles"."member_id" = ? LIMIT 1  [[nil, 1]]